#----------------------------------------------------
#                เครื่องหมายต่างๆ
#----------------------------------------------------
# เครื่องหมาย hat (^)ที่ใช้ในการยกกำลัง
# เครื่องหมาย slash (/) ที่ใช้ในการหาร
# เครื่องหมาย star (*) ที่ใช้ในการคูณ
# เครื่องหมายลบที่ใช้ในการลบ และบวก

# จะเริ่มคำนวณจากคำสั่งที่อยู่ในวงเล็บก่อน
#ตามมาด้วยการยกกำลัง
#การหาร
#การคูณ
#แล้วค่อยมาทำการลบและบวกนะครับ
(1+7)^2*8



#--------------------------------------------
#ตัวดำเนินการทางตรรกะศาสตร์ ที่ใช้ในโปรแกรม R ประกอบด้วย
#-------------------------------------------
# = เท่ากับ
# != ไม่เท่ากับ
# >, < มากกว่าและน้อยกว่า
# >=, <= มากกว่าเท่ากับ และน้อยกว่าเท่ากับ
# & และ
# | หรือ
# ! อัศเจรีย์ที่แสดงถึงการเป็นนิเสธ

x = 1
y = 3

x == y
x != y
x > y
x <= y
(x>2)&(y<5)
(x>2)|(y<5)
!((x>2)|(y<5))


#----------------------------
#        ฟังก์ชันพื้นฐาน
#------------------------------
#ฟังก์ชัน log สำหรับหาค่าล็อกฐานธรรมชาติ
#ฟังก์ชัน exp สำหรับหาค่าเลขชี้กำลัง
#ฟังก์ชัน sqrt สำหรับหาค่ารากที่ 2
#ฟังก์ชัน max และฟังก์ชัน min สำหรับหาค่าสูงสุดและต่ำสุดของเวกเตอร์

x = 4

log(x)
exp(x)
sqrt(x)

y = c(1,7,2,5,2,8)

max(y)
min(y)

#---------------------------------------------
#   สำหรับฟังก์ชันทางสถิติ ที่มักจะใช้ในโปรแกรมR ก็จะมี
#---------------------------------------------
#ฟังก์ชัน sum สำหรับหาค่าผลรวมของข้อมูลในเวกเตอร์
#ฟังก์ชัน mean สำหรับหาค่าเฉลี่ยในเวกเตอร์
#ฟังก์ชัน median สำหรับหาค่ามัธยฐานในเวกเตอร์
#ฟังก์ชัน var สำหรับหาความแปรปรวนของข้อมูลในเวกเตอร์
#ฟังก์ชัน sd สำหรับหาค่าส่วนเบี่ยงเบนมาตรฐานของข้อมูลในเวกเตอร์ x
#ฟังก์ชัน quantile สำหรับหาค่าเปอร์เซ็นไทล์ของเวกเตอร์ x

sum(y)
mean(y)
median(y)
var(y)
sd(y)
quantile(y,0.25) #โปรแกรมจะให้ค่าเปอร์เซ็นไทล์ที่ 25 ของข้อมูลใน y คือ 2


#-------------------------------------------
#        วิเคราะห์ข้อมูลในรูปของเมทริกซ์
#-------------------------------------------
# matrix( ) สำหรับสร้างเมทริกซ์
# %*%       สำหรับใช้คูณเมทริกซ์
# t( )      สำหรับทำทรานสโพสเมทริกซ์
# solve( )  สำหรับหาค่าอินเวอร์สของเมทริกซ์
# det( )    สำหรับหาค่าดีเทอร์มิแนนของเมทริกซ์

A = matrix(c(2,0,4,6,1,7,2,8,3),nrow=3,byrow = TRUE) #ถ้าต้องการให้สมาชิกที่กรอกมีการเรียงลำดับในเมทริกซ์ทางแถว
A

B = matrix(c(1,9,8,5,3,2,5,0,0),nrow=3,byrow = TRUE)
B

A%*%B
t(A%*%B)
solve(A%*%B)
det(A%*%B)

#สมมุติว่า ผมต้องการทราบวิธีการใช้งานคำสั่ง
#cumsum ที่ไว้สำหรับหาผลรวมสะสมของเวกเตอร์
#ให้ไปพิมพ์ชื่อคำสั่ง cumsum ที่ช่องค้นหา
#แล้วกด enter
#จะปรากฎรายละเอียดของคำสั่ง cumsum ที่หน้าต่าง Help

cumsum(1:10)

#แต่สำหรับคำสั่งใน Package อื่นๆนั้นจำเป็นต้องทำการดาวน์โหลด Package นั้นก่อนจึงจะสามารถใช้งานคำสั่งนั้นได้
#
#----------------------------------------------------------------