#          การประมาณค่าและการทดสอบสมมติฐาน

#-------------------------------------------------
#         ขั้นตอนในการทดสอบสมมุติฐานทางสถิตินั้น
#-------------------------------------------------
# ขั้นตอนที่ 1 คือกำหนดสมมุติฐาน ซึ่งประกอบด้วยสมมุติฐานหลัก H0
# และสมมุติฐานรอง H1 ซึ่งจะต้องมีความหมายตรงข้ามกับ H0 เสมอ

# ขั้นที่ 2 คือกำหนดระดับนัยสำคัญแอลฟา (??)
# ซึ่งเป็นขนาดของความผิดพลาดประเภทที่ 1 หรือเราอาจจะประกาศได้ว่า
# มันคือความน่าจะเป็นที่จะเป็นจริงปฏิเสธ H0 ที่จะเป็นจริงที่เรารับได้

# ขั้นที่ 3 คือการใช้งานคำสั่งสำหรับทดสอบสมมุติฐาน
# และพิจารณาค่า p-value ที่ได้จากคำสั่ง
# ถ้าค่า p-value ที่ได้มีค่าน้อยกว่า ?? ที่กำหนด ก็จะปฏิเสธ H0 ครับ

#ค่าเฉลี่ยของประชากรแทนด้วยพารามิเตอร์มิว (??)
#สามารถทำได้โดยใช้คำสั่ง t.test( )
#ซึ่งจะรับค่า 3 อย่างคือ x, mu และ alternative

# x คือค่าเวกเตอร์ของข้อมูลตัวอย่าง
# mu เป็นค่า ??0 ตรงสมมุติฐาน
# alternative กำหนดเป็น less สำหรับการทดสอบทางเดียวทางซ้าย
#กำหนดเป็น greater สำหรับการทดสอบทางเดียวทางขวา
#และกำหนดเป็น two.sided สำหรับการทดสอบสอง

#+++++++++++++++++Question+++++++++++++++++++++
#โดยฝ่ายควบคุมคุณภาพการผลิตต้องการทราบว่า
#ความหนาเฉลี่ยของชิ้นงานหล่อที่ผลิตจากเครื่องจักร A
#มากกว่า 5.3 มิลลิเมตรหรือไม่ ที่ระดับนัยสำคัญ 0.05

# Ho:mu <= 5.3
# H1:mu > 5.3

x = c(5.1, 5.4, 5.5, 5.6, 5.7, 5.8)
t.test(x,mu=5.3, alternative='greater')

# found p-value = 0.04281
# สรุป ความหนาเฉลี่ยของชิ้นงานหล่อที่ผลิตจากเครื่องจักร Aมากกว่า 5.3 มิลลิ

#+++++++++++++++++Question++++++++++++++++++++
#ฝ่ายควบคุมการผลิตต้องการทราบว่า
#ความหนาเฉลี่ยของชิ้นงานหล่อที่ผลิตจากเครื่องจักร A
#มีค่าเท่ากับ 5.3 มิลลิเมตรหรือไม่

t.test(x,mu=5.3, alternative='two.sided')

# p-value = 0.08562

#ความหนาเฉลี่ยของชิ้นงานหล่อที่ผลิตจากเครื่องจักร Aมีค่าเท่ากับ 5.3 มิล


# แล้วถ้าต้องการปรับระดับความเชื่อมั่นของช่วงความเชื่อมั่นนะครับ
# ให้ที่คำสั่ง t.testแล้วกำหนดค่า conf.level เท่ากับระดับความเชื่อมั่นที่ต้องการครับ
#เช่น ผมอยากได้ช่วงความเชื่อมั่น 99% ก็ให้ conf.level เท่ากับ 0.99

t.test(x,mu=5.3, alternative='two.sided',conf.level=0.99)

#*****************************************************
#       การอนุมานเกี่ยวกับค่าเฉลี่ยของประชากร 2 กลุ่ม            #
#*****************************************************
# ป้อนค่าเวกเตอร์ x และ y ซึ่งเป็นเวกเตอร์ของข้อมูลตัวอย่างทั้ง 2 ชุด
# กำหนดค่า mu ที่เป็น ??0 ตรงสมมุติฐาน
# กำหนด alternative เพื่อกำหนดว่าเป็นการทดสอบทางเดียวทางซ้ายทางขวา หรือสองทาง
# จากนั้นกำหนดค่า pairedเป็น TRUE เมื่อตัวอย่างมีความสัมพันธ์กันและเป็น FALSE เมื่อตัวอย่างเป็นอิสระกัน
# var.equalซึ่งให้เป็น TRUE เมื่อความแปรปรวนของประชาชนทั้ง 2 กลุ่มนั้นเท่ากันหรือไม่แตกต่างกันนะครับและให้เป็น FALSE เมื่อความแปรปรวนของประชาชนทั้ง 2 กลุ่มนั้นมีค่าแตกต่างกัน

#---------------Question---------------------
# สมมุติว่า นักวิจัยท่านหนึ่งต้องการศึกษาวิจัยว่า
# การตั้งครรภ์จะช่วยให้ขนาดของถุงน้ำช็อกโกแลตที่รังไข่ของผู้หญิง
# เล็กลงหรือไม่ ที่ระดับนัยสำคัญ 0.05

x = c(4,4,3,5,4,3,4,2,3,4)
y = c(2,2,1,3,2,2,2,0,1,2)

t.test(x,y,mu=0, alternative='less',paired=TRUE)
# p-value = 1 เนื่องจากค่า p-value มากกว่าระดับนัยสำคัญคือ 0.05จึงยอมรับสมมุติฐานหลัก H0
#และสรุปว่าเฉลี่ยของ x นั้นมากกว่าหรือเท่ากับค่าเฉลี่ยของ yหรือขนาดของถุงน้ำช็อกโกแลตตอนตั้งครรภ์ได้ 4 สัปดาห์ไม่ได้น้อยกว่าขนาดเฉลี่ยของถุงน้ำช็อกโกแลตหลังคลอดได้ 1 เดือน


# ขนาดเฉลี่ยของถุงน้ำช็อกโกแลตตอนตั้งครรภ์ได้ 4 สัปดาห์เท่ากับขนาดเฉลี่ยของถุงน้ำช็อกโกแลตตอนหลังคลอด 1 เดือนหรือไม่
t.test(x,y,mu=0, alternative='two.sided',paired=TRUE)
# ขนาดเฉลี่ยของถุงน้ำช็อกโกแลตของผู้หญิงที่ตั้งครรภ์ได้ 4 สัปดาห์
# มาลบกับขนาดเฉลี่ยถุงน้ำช็อกโกแลตหลังคลอดได้ 1 เดือน
# จะมีค่าอยู่ระหว่าง 1.673 เซนติเมตรถึง 2.126 เซนติเมตรนะครับ


#และในกรณีที่ต้องการปรับค่าระดับความเชื่อมั่น 0.90
t.test(x,y,mu=0, alternative='two.sided',paired=TRUE, conf.level=0.90)
# ซึ่งแสดงว่า ขนาดเฉลี่ยของถุงน้ำช็อกโกแลตตอนตั้งครรภ์ได้ 4 สัปดาห์
# เมื่อมาลบกับขนาดเฉลี่ยของถุงน้ำช็อกโกแลตตอนหลังคลอด 1 เดือน
# จะมีค่าผลต่างอยู่ระหว่าง 1.9 เซนติเมตรครับ

#***********Question************************
# ถ้ากระทรวงศึกษาธิการต้องการเปรียบเทียบคุณภาพการศึกษาระดับมัธยมต้นของโรงเรียนในกรุงเทพฯ กับโรงเรียนในต่างจังหวัดจึงทำการสุ่มตัวอย่างเด็กมัธยมต้น จากโรงเรียนในกรุงเทพฯและโรงเรียนต่างจังหวัดมา 5 และ 6 คนตามลำดับ
# แล้วต้องการทดสอบว่า คะแนนเฉลี่ยของเด็กทั้ง 2 กลุ่มเท่ากันหรือไม่ที่ระดับนัยสำคัญ 0.05

x = c(412,429,512,394,406)
y = c(404,425,208,326,449,378)

t.test(x,y,mu=0, alternative='two.sided',paired=FALSE, var.equal = TRUE)
# และเนื่องจากข้อมูลตัวอย่างทั้ง 2 ชุดเอามาจากเด็ก 2 กลุ่มที่ไม่มีความเกี่ยวข้องกันนะครับ
# ข้อมูลจึงไม่มีการจับคู่กันดังนั้นตรง paired ก็ให้เป็น FALSE

# และข้อมูลจากศึกษาในอดีตเราทราบว่าการแปรปรวนของคะแนนสอบของเด็กทั้ง 2 กลุ่มไม่แตกต่างกันนะครับดังนั้นตรง var.equal จึงป็น TRUE
# คือ แวเรียนซ์เท่ากันไหมให้เป็น TRUE

# โปรแกรมจะให้ค่าสถิติ t เท่ากับ 1.49 นะครับแล้วให้ค่า p-value เท่ากับ 0.1698 นะครับ
# เนื่องจากค่า p-value มากกว่าระดับนัยสำคัญคือ 0.05จึงยอมรับสมมุติฐานหลัก H0 และสรุปว่า
# คะแนนสอบเฉลี่ยของเด็กทั้ง 2 กลุ่มในกรุงเทพและในต่างจังหวัดไม่แตกต่างกันนะครับ


#*****************
# ความแปรปรวนของคะแนนเด็กทั้ง 2 กลุ่ม จริง ๆ แลัวไม่เท่ากันนะครับ
# ในการทดสอบสมมุติฐานพิมพ์คำสั่งเหมือนเดิมครับแต่เปลี่ยนแค่ var.equal ให้เป็น FALSE
t.test(x,y,mu=0, alternative='two.sided',paired=FALSE, var.equal = FALSE)



#------------------------------------------
# ความแปรปรวนของประชากร 2 กลุ่มหรือ ??x กับ ??y
#------------------------------------------

var.test(x, y)

# สำหรับการทดสอบว่าความแปรปรวนของทั้ง 2 กลุ่มเท่ากันหรือไม่
# เท่ากับ 0.2533 นะครับ ซึ่งมากกว่าระดับนัยสำคัญ 0.05
# ความแปรปรวนของคะแนนสอบของเด็กทั้ง 2 กลุ่มไม่แตกต่างกัน
# จึงควรกำหนดค่า var.equal เป็น TRUE


#--------------------------------------------
#    การอนุมานเกี่ยวกับสัดส่วนของประชากร
#--------------------------------------------
#ในกระบวนการผลิตวงจรหรือ chip นะครับของโทรศัพท์มือถือ
#สุ่มตัวอย่างมา 300 วงจรนะครับ พบว่ามี 13 วงจรที่เสีย
#จากข้อมูลที่มีอยู่จงทดสอบว่าสัดส่วนของเสียเท่ากับ 5% หรือไม่นะครับ
#โดยใช้ระดับนัยสำคัญ 0.05 การจะตอบคำถามว่า สัดส่วนของเสียเท่ากับ 5% หรือไม่

prop.test(x = 13, n = 300, p = 0.05, alternative = 'two.sided')
#มีอยู่ 13 หน่วยนะครับ
#ขนาดตัวอย่างก็คือ วงจรที่สุ่มมามีทั้งหมด 300 วงจรนะครับ
#แล้วก็กำหนดค่า p ตาม p0 ตรงสมมุติฐานก็คือ p เท่ากับ 0.05

#ผลการทดสอบ#
#สำหรับการทดสอบสัดส่วนประชากรออกมาคือ p-value เท่ากับ 0.6911
#ซึ่งมากกว่าระดับนัยสำคัญ 0.05 นะครับ จึงยอมรับสมมุติฐานหลัก H0
#และสรุปว่า สัดส่วนของของเสียเท่ากับ 5%


#และถ้าต้องการนะครับปรับค่าระดับความเชื่อมั่นของช่วงความเชื่อมั่นที่ได้นะครับ
#ก็สามารถทำได้โดยการกำหนดค่า conf.level ในคำสั่ง prop.test นะครับ
prop.test(x = 13, n = 300, p = 0.05, alternative = 'two.sided', conf.level = 0.99)


#+-----------------------------------------
#   การอนุมานเกี่ยวกับผลต่างสัดส่วนของ 2 ประชากร
#------------------------------------------

#ในการสำรวจความคิดเห็นเกี่ยวกับนโยบายกัญชาเสรีในจังหวัดเชียงใหม่นะครับ
#ถ้าได้สุ่มผู้อยู่อาศัยในเขตเทศบาลมา 500 คนพบว่ามี 385 คนที่เห็นด้วยกับนโยบายกัญชาเสรี
#และสุ่มตัวอย่างผู้อาศัยนอกเขตเทศบาลมา 400 คนพบว่ามี 267 คนที่เห็นด้วยกับนโยบายนี้นะครับ
#จงทดสอบว่าสัดส่วนของผู้ที่เห็นด้วยกับนโยบายกัญชาเสรีในจังหวัดเชียงใหม่ของทั้ง 2 เขตแตกต่างกันหรือไม่
#ที่ระดับนัยสำคัญ 0.05

prop.test(c(385,267), c(500,400), alternative = 'two.sided')
#โปรแกรมนะครับ จะให้ค่า p-value ของการทดสอบมานะครับก็คือเป็น 0.0008234 ตรงนี้นะครับ
#ซึ่งน้อยกว่าระดับนัยสำคัญ 0.05 จึงปฏิเสธสมมุติฐานหลัก H0 และสรุปว่า
#สัดส่วนของคนที่เห็นด้วยกับนโยบายกัญชาเสรีทั้ง 2 เขตในเทศบาลและนอกเทศบาลแตกต่างกันครับ

#--------------------------------------------------------------