#--------------------------------------------------------------
#                Analysis of Variance
#--------------------------------------------------------------
#การแห้งของสี 4 ชนิดนะครับโดยทดลองทาสีใส่วัสุดุทั้งหมด 16 ชิ้น
#ที่มีคุณลักษณะเหมือนกันทั้ง 16 ชิ้นนะครับโดยสุ่มสีและสุ่มวัสดุ
#ได้ข้อมูลเวลาแห้งของสีดังตารางครับจากนั้นจะมาทำการทดสอบว่าสีทั้ง 4 ชนิด
#มีระยะเวลาการแห้งเฉลี่ยเแตกต่างกันหรือไม่ที่ระดับนัยสำคัญ 0.05
time = c(31,30,28,28,32,33,29,31,28,29,29,30,26,27,26,27)
type = c('A','A','A','A','B','B','B','B','C','C','C','C','D','D','D','D')

data = data.frame(time, type)
data

summary(aov(lm(time~type,data)))
#สังเกตุที่ค่า p-value ข้างล่างนะครับจะเท่ากับ 0.00148ซึ่งน้อยกว่าระดับนัยสำคัญ 0.05
#จึงปฏิเสธสมมุติฐานหลักและสรุปได้ว่าสีทั้ง 4 ชนิดนะครับมีระยะเวลาการแห้งเฉลี่ยเแตกต่างกันอย่างน้อย 1 คู่


#แต่ถ้าต้องการทราบว่าสีคู่ไหนบ้างที่มันมีค่าเฉลี่ยแตกต่างกัน
#เราก็จะใช้วิธีการทดสอบตูกี้นะครับ
TukeyHSD(aov(time~type,data))

#เมื่อเราดูผลบรรทัดแรกที่เปรียบเทียบระยะเวลาการแห้งเฉลี่ยของสี B และ A นะครับ
#ได้ค่า p-value เท่ากับ 0.1579 นะครับซึ่งมากกว่าระดับนัยสำคัญ 0.05
#จึงยอมรับสมมุติฐานหลักและสรุปว่าสี A และสี B มีระยะเวลาการแห้งเฉลี่ยไม่เแตกต่างกัน

#สีที่มีระยะเวลาการแห้งเฉลี่ยแตกต่างกันคือ สี A กับสี Dและสี D กับสี B นะครับ


#------------------------------------------------------------
#         การวิเคราะห์ความแปรปรวนสองทาง
#------------------------------------------------------------
# โรงงานผลิตสินค้าแห่งหนึ่งมีเจ้าหน้าที่คุมเครื่องจักรอยุ่ 3 คนและเครื่องจักรที่ใช้ผลิตอยู่ 4 เครื่อง
# สมมุติว่าเป็นเครื่องจักร A, B, C, D นะครับในการทดสอบประสิทธิภาพในการทำงานของเจ้าหน้าที่และเครื่องจักรทั้งหมด
# ได้ให้เจ้าหน้าที่แต่ละคนคุมเครื่องจักรทุก ๆ เครื่องแล้ววัดจำนวนสินค้าที่ผลิตได้ปรากฏผลดังตารางครับ
# จากนั้นก็จะวิเคราะห์ข้อมูลที่ระดับนัยสำคัญ 0.05
output = c(202,78,112,248,210,82,110,246,194,77,105,232)
machine = c('A','A','A','A','B','B','B','B','C','C','C','C')
man = c('1','2','3','4','1','2','3','4','1','2','3','4')

data = data.frame(output, machine, man)
data

#anova(lm(output~machine+man, data))ซึ่งจะมีผลลัพธ์อยู่ 2 บรรทัด คือ man กับ machine
#จากนั้นให้สังเกตุค่า p-value ของ machine ก่อนนะครับจะได้เท่ากับ 0.027
#ซึ่งน้อยกว่าระดับนัยสำคัญ 0.05จึงสรุปได้ว่าปริมาณสินค้าที่ผลิตได้โดยเฉลี่ย
#ของเครื่องจักรทั้ง 3 เครื่องแตกต่างกันนะครับหรืออาจจะกล่าวได้ว่าเครื่องจักรที่ใช้มีอิทธิพลต่อปริมารสินค้าที่ผลิตได้

#และเมื่อสังเกตุค่า p-value ของ man จะได้เท่ากับ 1.299e-0.8
#ก็คือ 1.299 x 10 ยกกำลังลบ 8 ซึ่งก็น้อยกว่าระดับนัยสำคัญ 0.05
#จึงสรุปได้ว่าปริมาณสินค้าที่ผลิตได้โดยเฉลี่ยจากเจ้าหน้าที่ทั้ง 4 คน
#มีค่าแตกต่างกัน

#------------------------------------------------

# แต่ในบางครั้งปัจจัยที่หนึ่งหรือปัจจัยที่สองไม่มีผลหรือมีผลกับค่าที่เราศึกษาน้อยมาก
# แต่พอนำสองปัจจัยมารวมกันแล้วอาจจะมีผลกับค่าที่เราสนใจศึกษา ที่เรียกว่าอิทธิพลร่วม


#ยกตัวอย่างเช่น ในการสำรวจคะแนนสอบวิชาสถิติของนักศึกษาคณะ A, B, C 3 คณะนะครับ
#ผู้ทำการสำรวจต้องการทราบว่านักศึกษาทั้ง 3 คณะ มีความแตกต่างกันหรือไม่และนักศึกษาที่เป็นชายหรือหญิงจะทำคะแนนสอบเก่งกว่ากันหรือไม่นะครับ
#จึงเลือกตัวอย่างนักศึกษาชายและนักศึกษาหญิงมาเพศละ 5 คน จากทั้ง 3 คณะได้ข้อมูลคะแนนสอบวิชาสถิติเป็นดังตารางครับ
#จากนั้นก็จงวิเคราะห์ข้อมูลที่ระดับนัยสำคัญ 0.05
score = c(34,19,24,36,25,27,24,19,33,37,16,35,18,16,12,41,30,17,27,22,30,28,39,29,24,28,34,40,27,42)
sex = c('M','M','M','M','M','F','F','F','F','F','M','M','M','M','M','F','F','F','F','F','M','M','M','M','M','F','F','F','F','F')
fac = c('A','A','A','A','A','A','A','A','A','A','B','B','B','B','B','B','B','B','B','B','C','C','C','C','C','C','C','C','C','C')

data = data.frame(score,sex,fac)
data

#เพื่อจะอธิบายบอกโปรแกรมว่าตัวแบบคือค่า score จะแปรผันตามอิทธิพลของ sex
#และแปนผันตามอิทธิพลของ faculty คือคณะและก็ยังมีอิทธิพลร่วมของ sex กับ faculty ด้วย
anova(lm(score~sex*fac,data))

# คราวนี้เมื่อเราดูค่า p-value ทั้ง 3 ค่านะครับเราจะพบว่า p-value ทั้ง 3 ค่ามากกว่าระดับนัยสำคัญ 0.05
# จึงสรุปได้ว่าเพศ, คณะที่เรียนไม่มีอิทธิพลต่อคะแนนสอบและก็ไม่มีอิทธิพลร่วมระหว่างเพศกับคณะที่เรียนนะครับ

#--------------------------------------------------------------------------