#**************************************************
#     3.1 การวิเคราะห์ความสัมพันธ์จากข้อมูลขนาดใหญ่ 
#**************************************************

#เรื่องการวิเคราะห์ความสัมพันธ์จากข้อมูลขนาดใหญ่โดยใช้เทคนิคกฎความสัมพันธ์ซึ่งเป็นเทคนิคหนึ่งที่ใช้ในระบบแนะนำสินค้าค่ะ
#การวิเคราะห์กฎความสัมพันธ์เริ่มต้นมาจากการวิเคราะห์ตระกร้าสินค้าหรือที่เราเรียกกันว่า Market Basket Analysis

# ขั้นตอนการหากฎความสัมพันธ์
#  1.เริ่มจากการหา Itemset ที่เกิดขึ้นบ่อยหรือที่เรียกกันกว่า Frequent Itemsetโดยใช้ขั้นตอน apriori
#  2.เราจะนำมาสร้างกฎความสัมพันธ์หรือที่เรียกกันว่า Association Rule
#  3.เลือกกฎความสัมพันธ์ที่น่าสนใจโดยพิจารณาจากเกณฑ์ซึ่งก็คือค่า Supportค่า Confidence และค่า Lift

# ค่า Support หรือว่าค่าสนับสนุนคือค่าสัดส่วนของจำนวนรายการที่มีกลุ่มสินค้า A และกลุ่มสินค้า B ปรากฎอยู่ต่อจำนวนรายการซื้อสินค้าทั้งหมดในชุดข้อมูลที่นำมาวิเคราะหฺ์
# ค่าความเชื่อมัน Confidenceคือโอกาสที่ลูกค้าจะซื้อกลุ่มสินค้า Bเมื่อลูกค้าได้ซื้อกลุ่มสินค้า A
# ค่า Lift คือค่าที่บ่งบอกความสัมพันธ์ของการเกิดขึ้นของกลุ่มสินค้า A และกลุ่มสินค้า Bโดยที่ถ้าค่า Lift มีค่าน้อยกว่า 1 จะหมายถึง
#           กลุ่มของสินค้า A และกลุ่มของสินค้า B มีความสัมพันธ์กันเชิงลบนั่นก็คือถ้าลูกค้าซื้อกลุ่มสินค้า A แล้วเขาจะไม่ซื้อกลุ่มสินค้า B ค่ะ
#           ส่วนค่า Lift ที่มีค่ามากกว่า 1 หมายถึงกลุ่มของสินค้า A และกลุ่มของสินค้า B มีความสัมพันธ์กันเชิงบวกนั่นก็คือถ้าลูกค้าซื้อกลุ่มสินค้า A แล้ว เขาจะซื้อสินค้า B ค่ะ
#           และถ้า Lift มีค่าเท่ากับ 1 จะหมายถึงกลุ่มสินค้า A และกลุ่มสินค้า B ไม่มีความสัมพันธ์กัน


#install.packages("arules")
#install.packages("arulesViz")

library(arules)
library(arulesViz)

tdata <- read.transactions('datatest.csv', sep=',')
rules <- apriori(tdata, parameter = list(supp=0.4, conf=0.4, minlen=2))
summary(rules)
#ดูสิสถิติพรรนาของกฎ

#แสดงกฎความสัมพันธ์ที่ได้
inspect(rules)

#หากเราต้องการที่จะเรียงกฎตามค่าของ liftเพื่อให้ง่ายต่อการเลือกกฎที่น่าสนใจ
#ในกรณีที่มีจำนวนกฎมากเราก็สามารถทำได้
rules.sorted <- sort(rules,by='lift')
inspect(rules.sorted)

#ตอนนี้กฎที่เราได้จะเรียงตามค่าของ lift เรียบร้อยแล้วนะคะ

#ถ้าเราสังเกตจากกฎความสัมพันธ์ที่ได้เราจะเรียกพิจารณาค่า support Confidenceและ lift ที่มีค่ามากก่อนดังนั้นกฎแรกจึงเป็นกฎที่น่าสนใจค่ะ
#ซึ่งค่า support มีค่าเป็น 0.5 สำหรับกฎแรกก็คือbutter determine bread ก็หมายความว่ามีรายการที่ลูกค้าซื้อทั้ง
#butter และ bread เป็นจำนวนครึ่งหนึ่งของรายการสินค้าทั้งหมดที่นำมาวิเคราะห์ค่ะ

#เนื่องจากค่าลิฟท์มีค่ามากกว่า 1 หมายความว่าหากลูกค้าซื้อ butter แล้วเขาก็จะซื้อ bread

#*******กราฟแสดงความสัมพันธ์************
plot(rules)

#โหมดของ interactive 
plot(rules, engine = "interactive")

#ในที่นี้เราสนใจกฎที่อยู่มุมขวาเนื่องจากค่าของ support มีค่ามาก
#และค่า confidence ก็มีค่ามากและความเข้มสีก็คือค่า lift ก็มีค่ามากเช่นเดียวกัน

plot(rules, method = "graph")

#------------------------------------------------------------------
